espressif/arduino-esp32/libraries/BLE/src/BLEScan.cpp
      BLEAdvertisedDevice *advertisedDevice = nullptr;

      // If we've seen this device before get a pointer to it from the vector
      for (auto &it : pScan->m_scanResults.m_vectorAdvertisedDevices) {
        if (it.second->getAddress() == advertisedAddress) {
          advertisedDevice = it.second;
          break;
        }
      }

      // If we haven't seen this device before; create a new instance and insert it in the vector.
      // Otherwise just update the relevant parameters of the already known device.
      if (advertisedDevice == nullptr && event->disc.event_type != BLE_HCI_ADV_RPT_EVTYPE_SCAN_RSP) {
        // Check if we have reach the scan results limit, ignore this one if so.
        // We still need to store each device when maxResults is 0 to be able to append the scan results
        if (pScan->m_maxResults > 0 && pScan->m_maxResults < 0xFF && (pScan->m_scanResults.m_vectorAdvertisedDevices.size() >= pScan->m_maxResults)) {
          return 0;
        }
        advertisedDevice = new BLEAdvertisedDevice();
        advertisedDevice->setAddress(advertisedAddress);
        advertisedDevice->setAdvType(event->disc.event_type);
        pScan->m_scanResults.m_vectorAdvertisedDevices.insert(std::pair<std::string, BLEAdvertisedDevice *>(advertisedAddress.toString().c_str(), advertisedDevice));
        log_i("New advertiser: %s", advertisedAddress.toString().c_str());
      } else if (advertisedDevice != nullptr) {
        log_i("Updated advertiser: %s", advertisedAddress.toString().c_str());
      } else {
        // Scan response from unknown device
        return 0;
      }

      advertisedDevice->setRSSI(event->disc.rssi);
      advertisedDevice->setPayload((uint8_t *)event->disc.data, event->disc.length_data, event->disc.event_type == BLE_HCI_ADV_RPT_EVTYPE_SCAN_RSP);

      if (pScan->m_pAdvertisedDeviceCallbacks) {
        // If not active scanning or scan response is not available
        // report the result to the callback now.
        if (pScan->m_scan_params.passive
            || (advertisedDevice->getAdvType() != BLE_HCI_ADV_TYPE_ADV_IND && advertisedDevice->getAdvType() != BLE_HCI_ADV_TYPE_ADV_SCAN_IND)) {
          advertisedDevice->m_callbackSent = true;
          pScan->m_pAdvertisedDeviceCallbacks->onResult(*advertisedDevice);

          // Otherwise, wait for the scan response so we can report the complete data.
        } else if (event->disc.event_type == BLE_HCI_ADV_RPT_EVTYPE_SCAN_RSP) {
          advertisedDevice->m_callbackSent = true;
          pScan->m_pAdvertisedDeviceCallbacks->onResult(*advertisedDevice);
        }
        // If not storing results and we have invoked the callback, delete the device.
        if (pScan->m_maxResults == 0 && advertisedDevice->m_callbackSent) {
          pScan->erase(advertisedAddress);
        }
      }

      return 0;
    }

    case BLE_GAP_EVENT_DISC_COMPLETE:
    {
      log_d("discovery complete; reason=%d", event->disc_complete.reason);

      // If a device advertised with scan response available and it was not received
      // the callback would not have been invoked, so do it here.
      if (pScan->m_pAdvertisedDeviceCallbacks) {
        for (auto &it : pScan->m_scanResults.m_vectorAdvertisedDevices) {
          if (!it.second->m_callbackSent) {
            pScan->m_pAdvertisedDeviceCallbacks->onResult(*(it.second));
          }
        }
      }

      if (pScan->m_maxResults == 0) {
        pScan->clearResults();
      }

      if (pScan->m_scanCompleteCB != nullptr) {
        pScan->m_scanCompleteCB(pScan->m_scanResults);
      }

      if (pScan->m_pTaskData != nullptr) {
        pScan->m_pTaskData->rc = event->disc_complete.reason;
        xTaskNotifyGive(pScan->m_pTaskData->task);
      }

      return 0;
    }

    default: return 0;
  }
}  // gapEventHandler

/**
 * @brief Start scanning.
 * @param [in] duration The duration in seconds for which to scan.
 * @param [in] scanCompleteCB A function to be called when scanning has completed.
 * @param [in] is_continue Set to true to save previous scan results, false to clear them.
 * @return True if scan started or false if there was an error.
 */
bool BLEScan::start(uint32_t duration, void (*scanCompleteCB)(BLEScanResults), bool is_continue) {
  log_d(">> start(duration=%d)", duration);

  // Save the callback to be invoked when the scan completes.
  m_scanCompleteCB = scanCompleteCB;
  // Save the duration in the case that the host is reset so we can reuse it.
  m_duration = duration;

  // If 0 duration specified then we assume a continuous scan is desired.
  if (duration == 0) {
    duration = BLE_HS_FOREVER;
  } else {
    // convert duration to milliseconds
    duration = duration * 1000;
  }

  // Set the flag to ignore the results while we are deleting the vector
  if (!is_continue) {
    m_ignoreResults = true;
  }

  int rc = ble_gap_disc(BLEDevice::m_ownAddrType, duration, &m_scan_params, BLEScan::handleGAPEvent, this);

  switch (rc) {
    case 0:
      if (!is_continue) {
        clearResults();
      }
      break;

    case BLE_HS_EALREADY:
      break;

    case BLE_HS_EBUSY: log_e("Unable to scan - connection in progress."); break;

    case BLE_HS_ETIMEOUT_HCI:
    case BLE_HS_EOS:
    case BLE_HS_ECONTROLLER:
    case BLE_HS_ENOTSYNCED:   log_e("Unable to scan - Host Reset"); break;

    default: log_e("Error initiating GAP discovery procedure; rc=%d, %s", rc, BLEUtils::returnCodeToString(rc)); break;
  }

  m_ignoreResults = false;
  log_d("<< start()");

  if (rc != 0 && rc != BLE_HS_EALREADY) {
    return false;
  }
  return true;
}  // start

/**
 * @brief Start scanning and block until scanning has been completed.
 * @param [in] duration The duration in seconds for which to scan.
 * @param [in] is_continue Set to true to save previous scan results, false to clear them.
 * @return The BLEScanResults.
 */
BLEScanResults *BLEScan::start(uint32_t duration, bool is_continue) {
  if (duration == 0) {
    log_w("Blocking scan called with duration = forever");
  }

  TaskHandle_t cur_task = xTaskGetCurrentTaskHandle();
  ble_task_data_t taskData = {nullptr, cur_task, 0, nullptr};
  m_pTaskData = &taskData;

  if (start(duration, nullptr, is_continue)) {
#ifdef ulTaskNotifyValueClear
    // Clear the task notification value to ensure we block
    ulTaskNotifyValueClear(cur_task, ULONG_MAX);
#endif
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
  }

  m_pTaskData = nullptr;
  return &m_scanResults;
}  // start

/**
 * @brief Stop an in progress scan.
 * @return True if successful.
 */
bool BLEScan::stop() {
  log_d(">> stop()");

  int rc = ble_gap_disc_cancel();
  if (rc != 0 && rc != BLE_HS_EALREADY) {
    log_e("Failed to cancel scan; rc=%d", rc);
    return false;
  }

  if (m_maxResults == 0) {
    clearResults();
  }

  if (rc != BLE_HS_EALREADY && m_scanCompleteCB != nullptr) {
    m_scanCompleteCB(m_scanResults);
  }

  if (m_pTaskData != nullptr) {
    xTaskNotifyGive(m_pTaskData->task);
  }

  log_d("<< stop()");
  return true;
}  // stop

/**
 * @brief Called when host reset, we set a flag to stop scanning until synced.
 */
void BLEScan::onHostReset() {
  m_ignoreResults = true;
}

/**
 * @brief If the host reset and re-synced this is called.
 * If the application was scanning indefinitely with a callback, restart it.
 */
void BLEScan::onHostSync() {
  m_ignoreResults = false;

  if (m_duration == 0 && m_pAdvertisedDeviceCallbacks != nullptr) {
    start(m_duration, m_scanCompleteCB);
  }
}

#endif  // CONFIG_NIMBLE_ENABLED

#endif /* CONFIG_BLUEDROID_ENABLED || CONFIG_NIMBLE_ENABLED */
#endif /* SOC_BLE_SUPPORTED */
